
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 8 to change, 7 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-en.html&#34;]
* Update
  * azurerm_api_management_subscription.product[0]
  * azurerm_automation_account.automation_account
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.kv.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.html&#34;]
* Replace
  * azurerm_key_vault_access_policy.app_mi_access_policy
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once
  * module.sa.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.apim_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "apim_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-apim-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa"
        name                          = "pip-ss-stg-aa"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (10 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.app_mi_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ object_id               = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["admin-mfa-cy-GB.html"] will be created
  + resource "azurerm_storage_blob" "b2c_policy_files" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "admin-mfa-cy-GB.html"
      + parallelism            = 8
      + size                   = 0
      + source_content         = <<-EOT
            <html lang="en" class="govuk-template ">
            <head>
              <meta charset="utf-8">
              <title>
                Login
              </title>
              <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
              <meta name="theme-color" content="#0b0c0c">
              <link rel="shortcut icon" sizes="16x16 32x32 48x48" href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico"
                    type="image/x-icon">
              <meta http-equiv="X-UA-Compatible" content="IE=edge">
            </head>
            <body>
            <script>document.body.className = ((document.body.className) ? document.body.className + ' js-enabled' : 'js-enabled');</script>
            
            <a href="#main-content" class="govuk-skip-link">Skip to main content</a>
            
            <header class="govuk-header " role="banner" data-module="govuk-header">
              <div class="govuk-header__container govuk-width-container">
                <div class="govuk-header__logo">
                  <a href="https://www.gov.uk/" class="govuk-header__link govuk-header__link--homepage">
                    <span class="govuk-header__logotype">
                      <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" height="30" width="36"
                           class="govuk-header__logotype-crown-fallback-image"/>
                      <span class="govuk-header__logotype-text">
                        GOV.UK
                      </span>
                    </span>
                  </a>
                </div>
                <div class="govuk-header__content">
                  <a href="https://pip-frontend.staging.platform.hmcts.net/view-option" class="govuk-header__link govuk-header__link--service-name">
                    Gwrandawiadau llys a thribiwnlys
                  </a>
                </div>
              </div>
            </header>
            
            
            <div class="govuk-width-container ">
              <div class="govuk-phase-banner">
                <p class="govuk-phase-banner__content">
                  <strong class="govuk-tag govuk-phase-banner__content__tag">
                    beta
                  </strong>
                  <span class="govuk-phase-banner__text">
                  Mae hwn yn wasanaeth newydd – bydd eich <a id="betalink" class="govuk-link" href="https://www.smartsurvey.co.uk/s/FBSPI22/?pageurl=b2c/admin-mfa">adborth</a> yn ein helpu i’w wella.
                </span>
                </p>
              </div>
            
              <nav class="moj-sub-navigation pub-navigation govuk-!-margin-bottom-0" aria-label="Primary navigation">
            
                <ul class="moj-sub-navigation__list">
                  <li class="moj-sub-navigation__item">
                    <a class="moj-sub-navigation__link" href="https://pip-frontend.staging.platform.hmcts.net/view-option">Tudalen hafan</a>
                </ul>
              </nav>
            
              <main class="govuk-main-wrapper " id="main-content" role="main">
            
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" rel="stylesheet">
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.css" rel="stylesheet">
                <div class="row">
                  <div class="col1">
                    <div id="api">
                    </div>
                  </div>
                  <div class="col2">
                  </div>
                </div>
              </main>
            </div>
            
            <footer class="govuk-footer " role="contentinfo">
              <div class="govuk-width-container ">
            
                <div class="govuk-footer__meta">
                  <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
            
                    <h2 class="govuk-visually-hidden">Support links</h2>
            
                    <ul class="govuk-footer__inline-list">
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help">
                          Gymorth
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help/privacy-notice">
                          Preifatrwydd
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Cookie-policy">
                          Cwcis
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/accessibility-statement">
                          Datganiad hygyrchedd
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/contact">
                          Cysylltwch
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/help/terms-conditions">
                          Telerau ac amodau
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/cymraeg">
                          Cymraeg
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/government/organisations/government-digital-service">
                          Gwasanaeth Digidol y Llywodraeth
                        </a>
                      </li>
                    </ul>
            
                    <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.png" height="17" width="41"
                         class="govuk-footer__licence-logo"/>
                    <span class="govuk-footer__licence-description">
                      All content is available under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
                    </span>
                    <p class="govuk-footer__licence-description">When you use this information under the OGL,
                      you should include the following attribution: Contains public sector information licensed under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a>
                    </p>
                    <p class="govuk-footer__licence-description govuk-!-margin-0">The
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a> does not cover use of any personal data in the
                         court and tribunal hearings service. Personal data is subject to applicable data protection laws.
                    </p>
                  </div>
                  <div class="govuk-footer__meta-item">
                    <a class="govuk-footer__link govuk-footer__copyright-logo"
                       href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">©
                      Crown copyright</a>
                  </div>
                </div>
              </div>
            </footer>
            
            <script>
              function modalTimeoutCallback() {
                setTimeout(
                  function() {
                    const modalOverlay = document.getElementById('simplemodal-overlay');
                    const modalContainer = document.getElementById('simplemodal-container');
            
                    if (document.contains(modalOverlay) && document.contains(modalContainer)) {
                      modalOverlay.style.setProperty('display', 'block', 'important');
                      modalContainer.style.setProperty('display', 'block', 'important');
                    }
                  }, 5000);
              }
            
              const timeoutConfig = {
                attributes: true,
                attributeFilter: ["id"],
                attributeOldValue: true
              };
            
              const timeoutObserver = new MutationObserver(modalTimeoutCallback);
              const verifyingModal = document.getElementsByClassName("verifying-modal");
              timeoutObserver.observe(verifyingModal[0], timeoutConfig);
            </script>
            
            </body>
            </html>
        EOT
      + storage_account_name   = "pipsssastg"
      + storage_container_name = "b2c-custom-policy-files"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_policy_files["admin-mfa-en.html"] will be created
  + resource "azurerm_storage_blob" "b2c_policy_files" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "admin-mfa-en.html"
      + parallelism            = 8
      + size                   = 0
      + source_content         = <<-EOT
            <html lang="en" class="govuk-template ">
            <head>
              <meta charset="utf-8">
              <title>
                Login
              </title>
              <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
              <meta name="theme-color" content="#0b0c0c">
              <link rel="shortcut icon" sizes="16x16 32x32 48x48" href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico"
                    type="image/x-icon">
              <meta http-equiv="X-UA-Compatible" content="IE=edge">
            </head>
            <body>
            <script>document.body.className = ((document.body.className) ? document.body.className + ' js-enabled' : 'js-enabled');</script>
            
            <a href="#main-content" class="govuk-skip-link">Skip to main content</a>
            
            <header class="govuk-header " role="banner" data-module="govuk-header">
              <div class="govuk-header__container govuk-width-container">
                <div class="govuk-header__logo">
                  <a href="https://www.gov.uk/" class="govuk-header__link govuk-header__link--homepage">
                    <span class="govuk-header__logotype">
                      <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" height="30" width="36"
                           class="govuk-header__logotype-crown-fallback-image"/>
                      <span class="govuk-header__logotype-text">
                        GOV.UK
                      </span>
                    </span>
                  </a>
                </div>
                <div class="govuk-header__content">
                  <a href="https://pip-frontend.staging.platform.hmcts.net/view-option" class="govuk-header__link govuk-header__link--service-name">
                    Court and tribunal hearings
                  </a>
                </div>
              </div>
            </header>
            
            
            <div class="govuk-width-container ">
              <div class="govuk-phase-banner">
                <p class="govuk-phase-banner__content">
                  <strong class="govuk-tag govuk-phase-banner__content__tag">
                    beta
                  </strong>
                  <span class="govuk-phase-banner__text">
                  This is a new service – your <a id="betalink" class="govuk-link" href="https://www.smartsurvey.co.uk/s/FBSPI22/?pageurl=b2c/admin-mfa">feedback</a> will help us to improve it.
                </span>
                </p>
              </div>
            
              <nav class="moj-sub-navigation pub-navigation govuk-!-margin-bottom-0" aria-label="Primary navigation">
            
                <ul class="moj-sub-navigation__list">
                  <li class="moj-sub-navigation__item">
                    <a class="moj-sub-navigation__link" href="https://pip-frontend.staging.platform.hmcts.net/view-option">Home</a>
                </ul>
              </nav>
            
              <main class="govuk-main-wrapper " id="main-content" role="main">
            
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" rel="stylesheet">
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.css" rel="stylesheet">
                <div class="row">
                  <div class="col1">
                    <div id="api">
                    </div>
                  </div>
                  <div class="col2">
                  </div>
                </div>
              </main>
            </div>
            
            <footer class="govuk-footer " role="contentinfo">
              <div class="govuk-width-container ">
            
                <div class="govuk-footer__meta">
                  <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
            
                    <h2 class="govuk-visually-hidden">Support links</h2>
            
                    <ul class="govuk-footer__inline-list">
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help">
                          Help
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help/privacy-notice">
                          Privacy
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Cookie-policy">
                          Cookies
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/accessibility-stateme

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ce() {
                const passwordLabel = document.getElementById('newPassword_label');
            
                if (passwordLabel) {
                  const passwordAdvice = document.createElement('p');
                  const text = document.createTextNode('Your password must be 8-16 characters in length and contain 3 out of the 4 following: a lowercase character, uppercase character, a digit (0-9) or one or more of the following symbols @ # $ % ^ & * - _ + = [ ] { } | \\ : \' , ? / ` ~ " ( ) ; .');
                  passwordAdvice.appendChild(text);
            
                  const div = document.createElement('div');
                  div.className = 'passwordAdvice';
                  div.appendChild(passwordAdvice);
            
                  passwordLabel.parentNode.insertBefore(div, passwordLabel.nextSibling)
                }
              }
            
              replaceHeadingWithH2();
              setPasswordAdvice();
            </script>
            
            <script>
              function addGovukErrorSummary(headingErrors, verificationErrors) {
                const errorTitle = document.createElement('h2');
                errorTitle.className = 'govuk-error-summary__title';
                const titleText = document.createTextNode('There is a problem');
                errorTitle.appendChild(titleText);
            
                const errorBodyDiv = document.createElement('div');
                errorBodyDiv.className = 'govuk-error-summary__body';
                const errorCount = headingErrors.length;
            
                // The appendChild() method move the element after appending, hence we always use element index zero when accessing the next element.
                for (let i = 0; i < errorCount; i++) {
                  errorBodyDiv.appendChild(headingErrors[0]);
                }
            
                if (verificationErrors.length > 0) {
                  errorBodyDiv.appendChild(verificationErrors[0]);
                }
            
                const roleAlertDiv = document.createElement('div');
                roleAlertDiv.setAttribute("role", "alert");
                roleAlertDiv.appendChild(errorTitle);
                roleAlertDiv.appendChild(errorBodyDiv);
            
                const errorSummaryDiv = document.createElement('div');
                errorSummaryDiv.className = 'govuk-error-summary';
                errorSummaryDiv.appendChild(roleAlertDiv);
            
                const mainForm = document.getElementById('attributeVerification');
                mainForm.prepend(errorSummaryDiv);
              }
            
              function createErrorSummaryBox() {
                let displayError = false;
                const errorSummary = document.getElementsByClassName("govuk-error-summary");
                const headingErrors = document.getElementsByClassName("error pageLevel");
                const verificationErrors = document.getElementsByClassName('verificationErrorText error');
            
                if (localStorage.getItem('errorDisplayed') === 'no'
                  && errorSummary.length == 0) {
                  for (let i = 0; i < headingErrors.length; i++) {
                    if (window.getComputedStyle(headingErrors[i]).style !== 'none') {
                      displayError = true;
                      localStorage.setItem('errorDisplayed', 'yes');
                    }
                  }
            
                  if (!displayError
                    && verificationErrors.length > 0
                    && window.getComputedStyle(verificationErrors[0]).style !== 'none') {
                    displayError = true;
                    localStorage.setItem('errorDisplayed', 'yes');
                  }
                }
            
                if (displayError) {
                  addGovukErrorSummary(headingErrors, verificationErrors);
                }
              }
            
              function removeErrorSummaryBox() {
                const errorSummary = document.getElementsByClassName("govuk-error-summary");
            
                if (localStorage.getItem('errorDisplayed') === 'yes'&& errorSummary.length > 0) {
                  const errorTitle = document.getElementsByClassName("govuk-error-summary__title");
                  if (errorTitle.length > 0) {
                    errorTitle[0].remove();
                  }
            
                  const headingErrors = document.getElementsByClassName("error pageLevel");
                  const mainForm = document.getElementById('attributeVerification');
                  const errorCount = headingErrors.length;
            
                  for (let i = 0; i < errorCount; i++) {
                    mainForm.prepend(headingErrors[i]);
                  }
            
                  const verificationErrors = document.getElementsByClassName('verificationErrorText error');
                  const verificationControl = document.getElementById('emailVerificationControl');
                  if (verificationErrors.length > 0) {
                    verificationControl.prepend(verificationErrors[0]);
                  }
            
                  while (errorSummary.length > 0) {
                    errorSummary[0].parentNode.removeChild(errorSummary[0]);
                  }
                  localStorage.setItem('errorDisplayed', 'no');
                }
              }
            
              function observerCallback(mutationList, observer) {
                const displayNone = 'display: none;';
                const displayBlock = 'display: block;';
                const displayInline = 'display: inline;';
            
                for (const mutation of mutationList) {
                  const currentDisplay = mutation.target.getAttribute(mutation.attributeName);
                  if (mutation.oldValue === displayNone
                    && (currentDisplay === displayBlock || currentDisplay === displayInline)) {
                    createErrorSummaryBox();
                  } else if ((mutation.oldValue === displayBlock && currentDisplay === displayNone)
                    || (mutation.oldValue === displayInline && currentDisplay === displayNone)) {
                    removeErrorSummaryBox();
                  }
                }
              }
            
              const config = {
                attributes: true,
                attributeFilter: ["style"],
                attributeOldValue: true
              };
              const observer = new MutationObserver(observerCallback);
            
              const headingErrors = document.getElementsByClassName("error pageLevel");
              for (let i = 0; i < headingErrors.length; i++) {
                observer.observe(headingErrors[i], config);
              }
            
              const verificationError = document.getElementById('emailVerificationControl_error_message');
              if (verificationError) {
                observer.observe(verificationError, config);
              }
            
              function modalTimeoutCallback() {
                setTimeout(
                  function() {
                    const modalOverlay = document.getElementById('simplemodal-overlay');
                    const modalContainer = document.getElementById('simplemodal-container');
            
                    if (document.contains(modalOverlay) && document.contains(modalContainer)) {
                      modalOverlay.style.setProperty('display', 'block', 'important');
                      modalContainer.style.setProperty('display', 'block', 'important');
                    }
                  }, 5000);
              }
            
              const timeoutConfig = {
                attributes: true,
                attributeFilter: ["id"],
                attributeOldValue: true
              };
            
              const timeoutObserver = new MutationObserver(modalTimeoutCallback);
              const verifyingModal = document.getElementsByClassName("verifying-modal");
              timeoutObserver.observe(verifyingModal[0], timeoutConfig);
            
            </script>
            
            </body>
            </html>
        EOT -> null
      - storage_account_name   = "pipsssastg" -> null
      - storage_container_name = "b2c-custom-policy-files" -> null
      - type                   = "Block" -> null
      - url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.html" -> null
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/b1c4c969-099c-42cd-b306-eab51f75e1ad" -> (known after apply)
      ~ job_schedule_id         = "b1c4c969-099c-42cd-b306-eab51f75e1ad" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive value)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects_trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects_trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/f270cbaf-6822-434a-8d07-dd9118b45b00" -> (known after apply)
      ~ job_schedule_id         = "f270cbaf-6822-434a-8d07-dd9118b45b00" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive value)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2023-06-13T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2023-06-12T09:26:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg|pip-ss-sdp-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-sdp-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.redis.azurerm_resource_group.cache-resourcegroup has moved to module.redis.azurerm_resource_group.cache-resourcegroup[0]
    resource "azurerm_resource_group" "cache-resourcegroup" {
        id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-cache-stg"
        name     = "pip-cache-stg"
        tags     = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (1 unchanged attribute hidden)
    }

  # module.sa.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "storage-account-role-assignment" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg/providers/Microsoft.Authorization/roleAssignments/c46dbc39-991f-f508-67fe-0eb225bbde87" -> (known after apply)
      ~ name                             = "c46dbc39-991f-f508-67fe-0eb225bbde87" -> (known after apply)
      ~ principal_id                     = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 10 to add, 8 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":100,"Program":"tfcmt","SHA1":"","Vars":{}} -->